Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 VUs)"
scenarios:
  - name: "Login & Check Auth"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "john.doe@example.com"
            password: "password123"
          capture:
            json: "$.token"
            as: "userToken"
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ userToken }}"
